virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/spi.h
/* -------- SPI_TCR : (SPI Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define SPI_TCR_TXCTR_Pos                     _U_(0)                                               /**< (SPI_TCR) Transmit Counter Register Position */
#define SPI_TCR_TXCTR_Msk                     (_U_(0xFFFF) << SPI_TCR_TXCTR_Pos)                   /**< (SPI_TCR) Transmit Counter Register Mask */
#define SPI_TCR_TXCTR(value)                  (SPI_TCR_TXCTR_Msk & ((value) << SPI_TCR_TXCTR_Pos))
#define SPI_TCR_Msk                           _U_(0x0000FFFF)                                      /**< (SPI_TCR) Register Mask  */


/* -------- SPI_RNPR : (SPI Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define SPI_RNPR_RXNPTR_Pos                   _U_(0)                                               /**< (SPI_RNPR) Receive Next Pointer Position */
#define SPI_RNPR_RXNPTR_Msk                   (_U_(0xFFFFFFFF) << SPI_RNPR_RXNPTR_Pos)             /**< (SPI_RNPR) Receive Next Pointer Mask */
#define SPI_RNPR_RXNPTR(value)                (SPI_RNPR_RXNPTR_Msk & ((value) << SPI_RNPR_RXNPTR_Pos))
#define SPI_RNPR_Msk                          _U_(0xFFFFFFFF)                                      /**< (SPI_RNPR) Register Mask  */


/* -------- SPI_RNCR : (SPI Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define SPI_RNCR_RXNCTR_Pos                   _U_(0)                                               /**< (SPI_RNCR) Receive Next Counter Position */
#define SPI_RNCR_RXNCTR_Msk                   (_U_(0xFFFF) << SPI_RNCR_RXNCTR_Pos)                 /**< (SPI_RNCR) Receive Next Counter Mask */
#define SPI_RNCR_RXNCTR(value)                (SPI_RNCR_RXNCTR_Msk & ((value) << SPI_RNCR_RXNCTR_Pos))
#define SPI_RNCR_Msk                          _U_(0x0000FFFF)                                      /**< (SPI_RNCR) Register Mask  */


/* -------- SPI_TNPR : (SPI Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define SPI_TNPR_TXNPTR_Pos                   _U_(0)                                               /**< (SPI_TNPR) Transmit Next Pointer Position */
#define SPI_TNPR_TXNPTR_Msk                   (_U_(0xFFFFFFFF) << SPI_TNPR_TXNPTR_Pos)             /**< (SPI_TNPR) Transmit Next Pointer Mask */
#define SPI_TNPR_TXNPTR(value)                (SPI_TNPR_TXNPTR_Msk & ((value) << SPI_TNPR_TXNPTR_Pos))
#define SPI_TNPR_Msk                          _U_(0xFFFFFFFF)                                      /**< (SPI_TNPR) Register Mask  */


/* -------- SPI_TNCR : (SPI Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define SPI_TNCR_TXNCTR_Pos                   _U_(0)                                               /**< (SPI_TNCR) Transmit Counter Next Position */
#define SPI_TNCR_TXNCTR_Msk                   (_U_(0xFFFF) << SPI_TNCR_TXNCTR_Pos)                 /**< (SPI_TNCR) Transmit Counter Next Mask */
#define SPI_TNCR_TXNCTR(value)                (SPI_TNCR_TXNCTR_Msk & ((value) << SPI_TNCR_TXNCTR_Pos))
#define SPI_TNCR_Msk                          _U_(0x0000FFFF)                                      /**< (SPI_TNCR) Register Mask  */


/* -------- SPI_PTCR : (SPI Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define SPI_PTCR_RXTEN_Pos                    _U_(0)                                               /**< (SPI_PTCR) Receiver Transfer Enable Position */
#define SPI_PTCR_RXTEN_Msk                    (_U_(0x1) << SPI_PTCR_RXTEN_Pos)                     /**< (SPI_PTCR) Receiver Transfer Enable Mask */
#define SPI_PTCR_RXTEN(value)                 (SPI_PTCR_RXTEN_Msk & ((value) << SPI_PTCR_RXTEN_Pos))
#define SPI_PTCR_RXTDIS_Pos                   _U_(1)                                               /**< (SPI_PTCR) Receiver Transfer Disable Position */
#define SPI_PTCR_RXTDIS_Msk                   (_U_(0x1) << SPI_PTCR_RXTDIS_Pos)                    /**< (SPI_PTCR) Receiver Transfer Disable Mask */
#define SPI_PTCR_RXTDIS(value)                (SPI_PTCR_RXTDIS_Msk & ((value) << SPI_PTCR_RXTDIS_Pos))
#define SPI_PTCR_TXTEN_Pos                    _U_(8)                                               /**< (SPI_PTCR) Transmitter Transfer Enable Position */
#define SPI_PTCR_TXTEN_Msk                    (_U_(0x1) << SPI_PTCR_TXTEN_Pos)                     /**< (SPI_PTCR) Transmitter Transfer Enable Mask */
#define SPI_PTCR_TXTEN(value)                 (SPI_PTCR_TXTEN_Msk & ((value) << SPI_PTCR_TXTEN_Pos))
#define SPI_PTCR_TXTDIS_Pos                   _U_(9)                                               /**< (SPI_PTCR) Transmitter Transfer Disable Position */
#define SPI_PTCR_TXTDIS_Msk                   (_U_(0x1) << SPI_PTCR_TXTDIS_Pos)                    /**< (SPI_PTCR) Transmitter Transfer Disable Mask */
#define SPI_PTCR_TXTDIS(value)                (SPI_PTCR_TXTDIS_Msk & ((value) << SPI_PTCR_TXTDIS_Pos))
#define SPI_PTCR_RXCBEN_Pos                   _U_(16)                                              /**< (SPI_PTCR) Receiver Circular Buffer Enable Position */
#define SPI_PTCR_RXCBEN_Msk                   (_U_(0x1) << SPI_PTCR_RXCBEN_Pos)                    /**< (SPI_PTCR) Receiver Circular Buffer Enable Mask */
#define SPI_PTCR_RXCBEN(value)                (SPI_PTCR_RXCBEN_Msk & ((value) << SPI_PTCR_RXCBEN_Pos))
#define SPI_PTCR_RXCBDIS_Pos                  _U_(17)                                              /**< (SPI_PTCR) Receiver Circular Buffer Disable Position */
#define SPI_PTCR_RXCBDIS_Msk                  (_U_(0x1) << SPI_PTCR_RXCBDIS_Pos)                   /**< (SPI_PTCR) Receiver Circular Buffer Disable Mask */
#define SPI_PTCR_RXCBDIS(value)               (SPI_PTCR_RXCBDIS_Msk & ((value) << SPI_PTCR_RXCBDIS_Pos))
#define SPI_PTCR_TXCBEN_Pos                   _U_(18)                                              /**< (SPI_PTCR) Transmitter Circular Buffer Enable Position */
#define SPI_PTCR_TXCBEN_Msk                   (_U_(0x1) << SPI_PTCR_TXCBEN_Pos)                    /**< (SPI_PTCR) Transmitter Circular Buffer Enable Mask */
#define SPI_PTCR_TXCBEN(value)                (SPI_PTCR_TXCBEN_Msk & ((value) << SPI_PTCR_TXCBEN_Pos))
#define SPI_PTCR_TXCBDIS_Pos                  _U_(19)                                              /**< (SPI_PTCR) Transmitter Circular Buffer Disable Position */
#define SPI_PTCR_TXCBDIS_Msk                  (_U_(0x1) << SPI_PTCR_TXCBDIS_Pos)                   /**< (SPI_PTCR) Transmitter Circular Buffer Disable Mask */
#define SPI_PTCR_TXCBDIS(value)               (SPI_PTCR_TXCBDIS_Msk & ((value) << SPI_PTCR_TXCBDIS_Pos))
#define SPI_PTCR_ERRCLR_Pos                   _U_(24)                                              /**< (SPI_PTCR) Transfer Bus Error Clear Position */
#define SPI_PTCR_ERRCLR_Msk                   (_U_(0x1) << SPI_PTCR_ERRCLR_Pos)                    /**< (SPI_PTCR) Transfer Bus Error Clear Mask */
#define SPI_PTCR_ERRCLR(value)                (SPI_PTCR_ERRCLR_Msk & ((value) << SPI_PTCR_ERRCLR_Pos))
#define SPI_PTCR_Msk                          _U_(0x010F0303)                                      /**< (SPI_PTCR) Register Mask  */


/* -------- SPI_PTSR : (SPI Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define SPI_PTSR_RXTEN_Pos                    _U_(0)                                               /**< (SPI_PTSR) Receiver Transfer Enable Position */
#define SPI_PTSR_RXTEN_Msk                    (_U_(0x1) << SPI_PTSR_RXTEN_Pos)                     /**< (SPI_PTSR) Receiver Transfer Enable Mask */
#define SPI_PTSR_RXTEN(value)                 (SPI_PTSR_RXTEN_Msk & ((value) << SPI_PTSR_RXTEN_Pos))
#define SPI_PTSR_TXTEN_Pos                    _U_(8)                                               /**< (SPI_PTSR) Transmitter Transfer Enable Position */
#define SPI_PTSR_TXTEN_Msk                    (_U_(0x1) << SPI_PTSR_TXTEN_Pos)                     /**< (SPI_PTSR) Transmitter Transfer Enable Mask */
#define SPI_PTSR_TXTEN(value)                 (SPI_PTSR_TXTEN_Msk & ((value) << SPI_PTSR_TXTEN_Pos))
#define SPI_PTSR_RXCBEN_Pos                   _U_(16)                                              /**< (SPI_PTSR) Receiver Circular Buffer Enable Position */
#define SPI_PTSR_RXCBEN_Msk                   (_U_(0x1) << SPI_PTSR_RXCBEN_Pos)                    /**< (SPI_PTSR) Receiver Circular Buffer Enable Mask */
#define SPI_PTSR_RXCBEN(value)                (SPI_PTSR_RXCBEN_Msk & ((value) << SPI_PTSR_RXCBEN_Pos))
#define SPI_PTSR_TXCBEN_Pos                   _U_(18)                                              /**< (SPI_PTSR) Transmitter Circular Buffer Enable Position */
#define SPI_PTSR_TXCBEN_Msk                   (_U_(0x1) << SPI_PTSR_TXCBEN_Pos)                    /**< (SPI_PTSR) Transmitter Circular Buffer Enable Mask */
#define SPI_PTSR_TXCBEN(value)                (SPI_PTSR_TXCBEN_Msk & ((value) << SPI_PTSR_TXCBEN_Pos))
#define SPI_PTSR_ERR_Pos                      _U_(24)                                              /**< (SPI_PTSR) Transfer Bus Error Position */
#define SPI_PTSR_ERR_Msk                      (_U_(0x1) << SPI_PTSR_ERR_Pos)                       /**< (SPI_PTSR) Transfer Bus Error Mask */
#define SPI_PTSR_ERR(value)                   (SPI_PTSR_ERR_Msk & ((value) << SPI_PTSR_ERR_Pos))  
#define SPI_PTSR_Msk                          _U_(0x01050101)                                      /**< (SPI_PTSR) Register Mask  */


