virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/spi.h
/** \brief SPI register offsets definitions */
#define SPI_CR_REG_OFST                (0x00)              /**< (SPI_CR) SPI Control Register Offset */
#define SPI_MR_REG_OFST                (0x04)              /**< (SPI_MR) SPI Mode Register Offset */
#define SPI_RDR_REG_OFST               (0x08)              /**< (SPI_RDR) SPI Receive Data Register Offset */
#define SPI_TDR_REG_OFST               (0x0C)              /**< (SPI_TDR) SPI Transmit Data Register Offset */
#define SPI_SR_REG_OFST                (0x10)              /**< (SPI_SR) SPI Status Register Offset */
#define SPI_IER_REG_OFST               (0x14)              /**< (SPI_IER) SPI Interrupt Enable Register Offset */
#define SPI_IDR_REG_OFST               (0x18)              /**< (SPI_IDR) SPI Interrupt Disable Register Offset */
#define SPI_IMR_REG_OFST               (0x1C)              /**< (SPI_IMR) SPI Interrupt Mask Register Offset */
#define SPI_CSR_REG_OFST               (0x30)              /**< (SPI_CSR) SPI Chip Select Register 0 Offset */
#define SPI_CSR0_REG_OFST              (0x30)              /**< (SPI_CSR0) SPI Chip Select Register 0 Offset */
#define SPI_CSR1_REG_OFST              (0x34)              /**< (SPI_CSR1) SPI Chip Select Register 0 Offset */
#define SPI_CMPR_REG_OFST              (0x48)              /**< (SPI_CMPR) SPI Comparison Register Offset */
#define SPI_WPMR_REG_OFST              (0xE4)              /**< (SPI_WPMR) SPI Write Protection Mode Register Offset */
#define SPI_WPSR_REG_OFST              (0xE8)              /**< (SPI_WPSR) SPI Write Protection Status Register Offset */
#define SPI_RPR_REG_OFST               (0x100)             /**< (SPI_RPR) Receive Pointer Register Offset */
#define SPI_RCR_REG_OFST               (0x104)             /**< (SPI_RCR) Receive Counter Register Offset */
#define SPI_TPR_REG_OFST               (0x108)             /**< (SPI_TPR) Transmit Pointer Register Offset */
#define SPI_TCR_REG_OFST               (0x10C)             /**< (SPI_TCR) Transmit Counter Register Offset */
#define SPI_RNPR_REG_OFST              (0x110)             /**< (SPI_RNPR) Receive Next Pointer Register Offset */
#define SPI_RNCR_REG_OFST              (0x114)             /**< (SPI_RNCR) Receive Next Counter Register Offset */
#define SPI_TNPR_REG_OFST              (0x118)             /**< (SPI_TNPR) Transmit Next Pointer Register Offset */
#define SPI_TNCR_REG_OFST              (0x11C)             /**< (SPI_TNCR) Transmit Next Counter Register Offset */
#define SPI_PTCR_REG_OFST              (0x120)             /**< (SPI_PTCR) Transfer Control Register Offset */
#define SPI_PTSR_REG_OFST              (0x124)             /**< (SPI_PTSR) Transfer Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SPI register API structure */
typedef struct
{
  __O   uint32_t                       SPI_CR;             /**< Offset: 0x00 ( /W  32) SPI Control Register */
  __IO  uint32_t                       SPI_MR;             /**< Offset: 0x04 (R/W  32) SPI Mode Register */
  __I   uint32_t                       SPI_RDR;            /**< Offset: 0x08 (R/   32) SPI Receive Data Register */
  __O   uint32_t                       SPI_TDR;            /**< Offset: 0x0C ( /W  32) SPI Transmit Data Register */
  __I   uint32_t                       SPI_SR;             /**< Offset: 0x10 (R/   32) SPI Status Register */
  __O   uint32_t                       SPI_IER;            /**< Offset: 0x14 ( /W  32) SPI Interrupt Enable Register */
  __O   uint32_t                       SPI_IDR;            /**< Offset: 0x18 ( /W  32) SPI Interrupt Disable Register */
  __I   uint32_t                       SPI_IMR;            /**< Offset: 0x1C (R/   32) SPI Interrupt Mask Register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       SPI_CSR[2];         /**< Offset: 0x30 (R/W  32) SPI Chip Select Register 0 */
  __I   uint8_t                        Reserved2[0x10];
  __IO  uint32_t                       SPI_CMPR;           /**< Offset: 0x48 (R/W  32) SPI Comparison Register */
  __I   uint8_t                        Reserved3[0x98];
  __IO  uint32_t                       SPI_WPMR;           /**< Offset: 0xE4 (R/W  32) SPI Write Protection Mode Register */
  __I   uint32_t                       SPI_WPSR;           /**< Offset: 0xE8 (R/   32) SPI Write Protection Status Register */
  __I   uint8_t                        Reserved4[0x14];
  __IO  uint32_t                       SPI_RPR;            /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO  uint32_t                       SPI_RCR;            /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO  uint32_t                       SPI_TPR;            /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO  uint32_t                       SPI_TCR;            /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO  uint32_t                       SPI_RNPR;           /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO  uint32_t                       SPI_RNCR;           /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO  uint32_t                       SPI_TNPR;           /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO  uint32_t                       SPI_TNCR;           /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O   uint32_t                       SPI_PTCR;           /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I   uint32_t                       SPI_PTSR;           /**< Offset: 0x124 (R/   32) Transfer Status Register */
} spi_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMG55_SPI_COMPONENT_H_ */
